{
  "Blue Whale": "The largest mammal on Earth, they feed almost exclusively on krill",
  "Inland Taipan": "Most venomous animal on earth, native to Australia",
  "Armadillo": "This mammal has a unique bony armor shell for protection.",
  "Puma": "Also called a cougar or mountain lion, a powerful wild cat.",
  "Butterfly": "An insect with colorful wings that starts as a caterpillar. They taste with their feet",
  "Narwhal": "A type of whale known for its single, long, spiral tusk. Found in Arctic waters",
  "Hummingbird": "The smallest bird in the world, it can hover in the air.",
  "Opossum": "North America's only marsupial, it 'plays dead' when scared.",
  "Starfish": "This sea creature can regrow its arms if they are lost.",
  "Spider Monkey": "A monkey with very long arms and legs, and a prehensile tail.",
  "Lionfish": "A venomous fish with striking stripes and long fins.",
  "Flamingo": "Born grey, this bird gets its bright pink color from the food it eats.",
  "Peregrine Falcon": "The fastest animal on the entire planet. Can reach speeds of up to 390kmph during dive",
  "Moose": "The largest member of the deer family, with huge antlers.",
  "Poison Dart Frog": "The most poisonous animal on earth, native to Colombia",
  "Condor": "A very large vulture with a huge wingspan, also the largest bird of prey",
  "Kookaburra": "An Australian bird famous for its laugh-like call.",
  "Beaver": "Known for building dams and lodges in rivers.",
  "Eagle Ray": "A type of ray that looks like it's flying underwater.",
  "Reticulated Python": "The longest snake in the world.",
  "Thresher Shark": "A shark with a very long, whip-like tail that it uses to stun prey.",
  "Cormorant": "A diving seabird that catches fish.",
  "Koala": "Native to Australia, it mostly sleeps and eats eucalyptus leaves.",
  "Giraffe": "The tallest mammal, with a super long neck to reach high leaves.",
  "Wolf": "A wild dog that lives and hunts in packs.",
  "Pika": "A small, furry animal that looks like a rabbit without a tail.",
  "Pelican": "This bird has a large pouch under its beak to scoop up fish.",
  "Kudu": "A large African antelope with impressive spiral horns.",
  "Salamander": "An amphibian that can regrow lost body parts.",
  "Alpaca": "A gentle mammal from the mountains, known for its soft wool.",
  "Wildebeest": "Also called a gnu, known for their massive migrations.",
  "Chinchilla": "A small rodent from South America, known for its incredibly soft fur.",
  "Sturgeon": "A very ancient fish that can live for over 100 years.",
  "Walrus": "A large marine mammal with long, impressive tusks.",
  "Marten": "A slender, tree-climbing mammal related to weasels.",
  "Yak": "A long-haired animal related to cattle, found in the Himalayas.",
  "Chimpanzee": "A very intelligent ape, closely related to humans.",
  "Great White Shark": "A large and powerful ocean predator.",
  "Bighorn Sheep": "Known for the huge, curving horns of the male of this species.",
  "Lynx": "A wild cat with tufted ears and short tails, excellent hunters.",
  "Elephant Seal": "The biggest type of seal, males have a big, floppy nose.",
  "Blue Jay": "A smart and noisy bird with bright blue, white, and black feathers.",
  "Mongoose": "A small, quick animal famous for fighting snakes.",
  "Pufferfish": "This fish can puff up its body like a ball to scare away predators.",
  "Sun Bear": "The smallest type of bear, with a distinctive orange patch on its chest.",
  "Whale Shark": "The largest fish in the world, but it eats tiny plankton.",
  "Cheetah": "The fastest land animal, known for its spotted coat.",
  "Aardvark": "Its name means 'earth pig' because this mammal digs like a pig.",
  "Dugong": "A gentle marine mammal, similar to a manatee, that eats seagrass.",
  "Goliath Frog": "The largest frog in the world, found in West Africa.",
  "Dragonfly": "An insect with large eyes and two pairs of strong, clear wings.",
  "Nudibranch": "A colorful sea slug that looks like a moving piece of art.",
  "Kākāpō": "The world's only flightless and nocturnal parrot, from New Zealand.",
  "Siberian Tiger": "The largest and heaviest type of tiger.",
  "Echidna": "A unique Australian animal that lays eggs but feeds its babies milk.",
  "Mako Shark": "One of the fastest sharks in the ocean.",
  "Sea Otter": "Known for holding hands (or paws) with other animals of its kind while they sleep.",
  "Osprey": "A bird of prey that specializes in catching fish.",
  "Ferret": "A playful and curious pet that loves to explore small spaces.",
  "Sea Krait": "A venomous sea snake that spends most of its life in the ocean.",
  "Marlin": "A very fast, sword-like fish known for its long, pointed bill.",
  "Rhinoceros": "A large mammal with one or two horns on its snout.",
  "Elephant": "The largest land mammal, known for its long trunk and tusks.",
  "Snow Leopard": "A beautiful big cat with a thick, spotted coat for cold mountains.",
  "Honey Badger": "Fearless and tough, this mammal is known for taking on much larger animals.",
  "Kangaroo": "A marsupial from Australia that hops on powerful hind legs.",
  "Raccoon": "Recognizable by its 'mask' around its eyes and clever paws.",
  "Kingfisher": "A small bird with bright colors, known for diving headfirst for fish.",
  "Spider": "An arachnid with eight legs and usually builds webs.",
  "Roadrunner": "A fast-running bird from the desert, famous from cartoons.",
  "Sea Anemone": "Looks like a flower but is a predatory animal in the sea.",
  "Pied Kingfisher": "A black and white kingfisher, often seen hovering over water.",
  "Lion": "Often called the 'king of the jungle,' living in prides.",
  "Grizzly Bear": "A powerful type of brown bear, known for its long claws.",
  "Humpback Whale": "Known for its amazing acrobatics, like breaching out of the water.",
  "Squirrel": "Known for its bushy tail and burying nuts for winter.",
  "Tarsier": "A tiny primate with enormous eyes that can't move, so its head swivels.",
  "Stork": "A large wading bird often seen carrying babies in cartoons, though it's not true!",
  "Kangaroo Rat": "A desert rodent that hops like a tiny kangaroo.",
  "Pony": "A small type of horse.",
  "Pelagic Thresher Shark": "Known for its incredibly long, whip-like tail.",
  "Bison": "A large, shaggy mammal, once common on the American plains.",
  "Mandrill": "The largest monkey species, with a brightly colored face.",
  "Coyote": "A wild dog that lives in North America, known for its howling.",
  "Sea Slug": "A soft-bodied marine creature, often brightly colored.",
  "Fox": "Clever and adaptable, this canine is often seen in many different habitats.",
  "Goliath Beetle": "One of the heaviest and largest insects in the world.",
  "Rhea": "A large, flightless bird from South America, similar to an ostrich.",
  "Goose": "A large water bird that often flies in V-shaped formations.",
  "Musk Ox": "This animal has a very thick coat of hair to stay warm in the Arctic.",
  "Crab": "A sea creature with a hard shell, ten legs, and often two large claws.",
  "Flying Fish": "This fish can leap out of the water and glide for long distances.",
  "Tiger Moth": "A moth with bold, often striped or spotted patterns on its wings.",
  "Cobra": "A venomous snake known for spreading its neck ribs into a hood.",
  "Tiger Salamander": "A large, colorful salamander that lives on land.",
  "Wren": "A small, plump bird with a short, upturned tail.",
  "Sunfish": "A huge, flat, disc-shaped fish that loves to bask in the sun.",
  "Scorpion": "An arachnid with a venomous stinger on its tail.",
  "Rhino Beetle": "A large beetle with a horn-like projection on its head.",
  "Macaw": "A large, colorful parrot known for being smart and loud.",
  "Coral": "Tiny sea animals that build hard, stony structures, forming reefs.",
  "Javan Rhino": "One of the rarest large mammals on Earth.",
  "Giant Panda": "This mammal mostly eats bamboo all day long.",
  "Komodo Dragon": "The largest lizard in the world, found on a few Indonesian islands.",
  "Okapi": "Looks like a mix between a zebra and a giraffe, but is a type of giraffe.",
  "Gnu": "Also called a wildebeest, these animals are known for their massive migrations.",
  "Deer": "A graceful animal, males often have antlers that they shed every year.",
  "Beetle": "The most common type of insect, with hard wing covers.",
  "Manta Ray": "The largest type of ray, it swims like a giant bird in the ocean.",
  "Heron": "A tall, long-legged bird that patiently waits for fish in water.",
  "Dachshund": "A dog breed with a long body and short legs, also called a 'wiener dog'.",
  "Paca": "A large rodent from Central and South America with spotted fur.",
  "Sperm Whale": "The largest toothed whale, famous for its giant head.",
  "Tegu": "A large, intelligent lizard from South America.",
  "Puli": "A dog breed known for its long, corded hair that looks like dreadlocks.",
  "Warthog": "A wild pig from Africa with noticeable tusks and 'warts' on its face.",
  "Hornbill": "Known for its giant, colorful beak, some species seal their nests.",
  "Frogfish": "A master of camouflage, it waits for prey to come to it.",
  "Praying Mantis": "An insect with front legs held together as if in prayer.",
  "Tibetan Fox": "A fox found on the high Tibetan Plateau, known for its square face.",
  "Monarch Butterfly": "Famous for its long migration, flying thousands of miles.",
  "Sea Lion": "A playful marine mammal that can balance balls on its nose.",
  "Goldfish": "A common pet fish, originally from China.",
  "Wasp": "A stinging insect, often confused with a bee.",
  "Kestrel": "A small type of falcon that hovers in the air when hunting.",
  "Squacco Heron": "A small heron with a streaky brown back.",
  "Rosy Boa": "A small, harmless snake often kept as a pet.",
  "Vicuña": "A wild animal related to llamas, known for its extremely fine wool.",
  "Mynah Bird": "A bird known for being able to copy human speech and words.",
  "Rock Hyrax": "A small, furry mammal that looks a bit like a guinea pig but is related to elephants.",
  "Takin": "A large goat-antelope found in the Himalayas, looks like a mix of several animals.",
  "Tern": "A graceful seabird, similar to a gull but usually more slender.",
  "Tiger Shark": "Known for its striped pattern when it's young, like a tiger.",
  "Eland": "The largest type of antelope, it can jump surprisingly high.",
  "Eel": "Some of these fish can produce electricity to stun their prey.",
  "Hog": "Another name for a pig, often used for wild pigs.",
  "Black Mamba": "One of the fastest and most venomous snakes in Africa.",
  "Silverback Gorilla": "The leader of a gorilla group, known for the gray fur on its back.",
  "Penguin": "A flightless bird that lives in cold places and swims expertly.",
  "Brown Bear": "A large bear species, found in forests and mountains.",
  "Zebra": "Famous for its distinctive black and white stripes.",
  "Sardine": "A small, oily fish that swims in huge schools.",
  "Python": "A large, non-venomous snake that squeezes its prey.",
  "Kiwi": "A strange, flightless bird from New Zealand with long whiskers.",
  "Seahorse": "The male of this fish species is the one that carries the eggs!",
  "Viper": "A type of venomous snake.",
  "Hammerhead Shark": "This fish has a unique hammer-shaped head that helps it see and hunt.",
  "Ox": "A type of cow used for pulling carts or plows.",
  "Leopard": "A powerful big cat known for its spotted coat and climbing skills.",
  "Fennec Fox": "This small mammal has huge ears to help it hear prey and cool down in the desert.",
  "Toucan": "A tropical bird known for its giant, colorful beak.",
  "Wombat": "A short-legged, muscular marsupial from Australia that digs burrows.",
  "Lobster": "A sea creature with a hard shell and two large claws.",
  "Moth": "A nocturnal insect, often mistaken for a butterfly.",
  "Catfish": "A fish with long whiskers, like a cat's.",
  "Vulture": "A bird of prey that eats dead animals, helping to clean up nature.",
  "Abalone": "A large sea snail with a beautiful, iridescent inner shell.",
  "Hippo": "This large mammal spends most of its day in rivers and lakes to keep cool.",
  "Goat": "One of the first animals people ever tamed, they love to climb.",
  "Piranha": "A fish from South America known for its very sharp teeth.",
  "Guppy": "A small, colorful freshwater fish, popular in aquariums.",
  "Crocodile": "A large predatory reptile that lives in tropical wetlands.",
  "Mole": "This mammal lives mostly underground and has very tiny eyes.",
  "Ant": "Tiny but mighty, these insects can lift 50 times their own weight!",
  "Cockroach": "An ancient and very tough insect.",
  "Jaguar": "The largest cat in the Americas, known for its spotted coat.",
  "Snake": "A legless reptile, some are venomous, some are constrictors.",
  "Stingray": "A flat fish with a long tail that can have a venomous barb.",
  "Chameleon": "A lizard famous for changing its skin color to match its surroundings.",
  "Ostrich": "The largest living bird, it cannot fly but can run very fast.",
  "Alligator": "This large reptile can live for over 50 years and has a powerful bite.",
  "Red Panda": "A small, tree-dwelling mammal with reddish-brown fur, not a bear.",
  "Horse": "One of the most important animals to humans, used for riding and work.",
  "Harpy Eagle": "One of the biggest and strongest eagles in the world.",
  "Ibex": "A wild goat with long, curved horns, found in rocky mountains.",
  "Impala": "A graceful antelope from Africa known for its incredible jumps.",
  "Jackal": "A scavenger animal similar to a small wolf.",
  "Jellyfish": "This sea creature has no brain, heart, or bones, but can still catch food.",
  "Lamb": "A baby sheep, known for its soft wool.",
  "Langur": "A type of monkey found in Asia, with long tails.",
  "Lemur": "Primates found only on the island of Madagascar, with big eyes.",
  "Llama": "A South American mammal related to camels, used for carrying loads.",
  "Locust": "A type of grasshopper that can form huge, destructive swarms.",
  "Loon": "A diving water bird with a haunting, yodel-like call.",
  "Loris": "A small, slow-moving primate with huge, round eyes.",
  "Lungfish": "A special fish that can breathe air when its water dries up.",
  "Lyrebird": "An amazing bird that can mimic almost any sound it hears.",
  "Mackerel": "A fast-swimming fish often found in large schools.",
  "Magpie": "A smart bird known for being attracted to shiny objects.",
  "Mallard": "A very common duck, the male has a shiny green head.",
  "Manatee": "A gentle, slow-moving marine mammal also called a 'sea cow'.",
  "Mantis": "A long, slender insect that holds its front legs like it's praying.",
  "Mink": "A sleek, semi-aquatic mammal known for its valuable fur.",
  "Monkey": "A diverse group of primates, many known for swinging through trees.",
  "Mosquito": "A tiny insect that can carry diseases when it bites.",
  "Mountain Goat": "Amazing climbers, these animals live in high, rocky mountains.",
  "Mouse": "A small rodent, one of the most common mammals.",
  "Nightingale": "A small bird famous for its beautiful and complex song.",
  "Nile Crocodile": "The largest reptile in Africa, a powerful hunter.",
  "Nutcracker": "A bird that is very good at cracking open nuts and seeds.",
  "Nutria": "A large, furry rodent often found near water.",
  "Oriole": "A colorful songbird, often bright orange or yellow.",
  "Otter": "Playful and graceful in the water, these mammals love to eat fish.",
  "Owl": "Nocturnal birds with excellent hearing and can turn their heads almost all the way around.",
  "Panda": "A beloved animal from China, famous for eating only bamboo.",
  "Panther": "A black version of a leopard or jaguar, very stealthy.",
  "Parakeet": "A small, colorful parrot often kept as a pet.",
  "Parrot": "Known for their bright colors and ability to mimic sounds and words.",
  "Partridge": "A small game bird that lives on the ground.",
  "Peacock": "Males are famous for their giant, beautiful tail feathers.",
  "Pheasant": "A colorful game bird with a long tail.",
  "Pigeon": "A very common bird found in cities around the world.",
  "Pig": "A smart and curious farm animal.",
  "Pike": "A long, predatory freshwater fish with sharp teeth.",
  "Platypus": "A very unique animal from Australia that lays eggs but is a mammal.",
  "Polar Bear": "The largest land predator, lives in the Arctic and loves ice.",
  "Porcupine": "This rodent has sharp quills all over its body for defense.",
  "Porpoise": "A small type of whale, similar to a dolphin.",
  "Possum": "A diverse group of animals, some that live in trees and others that 'play dead'.",
  "Pronghorn": "The fastest land animal in North America.",
  "Puffin": "A seabird with a colorful beak during breeding season.",
  "Quail": "A small, plump game bird.",
  "Quetzal": "A beautiful bird from Central America with very long tail feathers.",
  "Ram": "A male sheep, known for its large, curling horns.",
  "Rat": "A common rodent, known for being very adaptable.",
  "Rattlesnake": "A venomous snake that shakes its tail to make a rattling sound.",
  "Raven": "A large, intelligent black bird, often seen in stories.",
  "Reindeer": "Known for their antlers, both males and females grow them.",
  "Robin": "A very common songbird with a reddish chest.",
  "Rooster": "A male chicken, known for crowing loudly in the morning.",
  "Rook": "A black bird in the crow family, often seen in large groups.",
  "Salmon": "A fish famous for swimming upstream to lay its eggs.",
  "Sand Dollar": "A flat, round sea creature with a star pattern on top.",
  "Sawfish": "A type of ray with a long, saw-like snout for hunting.",
  "Scallop": "A type of shellfish that can clap its shells together to swim.",
  "Seal": "A carnivorous marine mammal with flippers, great at swimming and diving.",
  "Shark": "This fish has a skeleton made of cartilage, not bone, and super sharp teeth.",
  "Sheep": "A domesticated animal known for its wool.",
  "Shrew": "A tiny, mouse-like mammal with a very long snout.",
  "Shrimp": "A small, delicious crustacean found in oceans and rivers.",
  "Skink": "A type of lizard with a long, smooth body.",
  "Skunk": "Known for spraying a foul-smelling liquid when it feels threatened.",
  "Sloth": "Famous for being one of the slowest animals on Earth.",
  "Snail": "A slow-moving creature that carries its shell on its back.",
  "Snipe": "A wading bird known for being very hard to spot due to camouflage.",
  "Sparrow": "A small, common bird often seen in gardens and parks.",
  "Squid": "A sea creature with ten arms, two of which are longer tentacles.",
  "Stoat": "A small, fierce hunter related to weasels.",
  "Swallow": "A small, agile bird known for its graceful flight.",
  "Swan": "A large, beautiful water bird with a long, elegant neck.",
  "Swordfish": "Known for its long, sword-like bill used to slash prey.",
  "Tapir": "A large, pig-like mammal with a short, flexible trunk.",
  "Tasmanian Devil": "A feisty, carnivorous marsupial from Tasmania.",
  "Termite": "Small insects that build giant mound nests and eat wood.",
  "Tiger": "The largest cat, known for its distinctive stripes.",
  "Toad": "A bumpy-skinned amphibian, often found in gardens.",
  "Trout": "A popular freshwater fish, often caught for sport.",
  "Tuna": "A large, fast-swimming fish important for food.",
  "Turkey": "A large bird native to North America, known for its gobble.",
  "Turtle": "A reptile with a hard, protective shell.",
  "Woodcock": "A bird with long legs and a very long beak for probing in mud.",
  "Adder": "A common venomous snake found in Europe.",
  "Baboon": "A large, powerful monkey that lives in groups.",
  "Badger": "A burrowing animal with a distinctive striped face.",
  "Barnacle": "A small sea creature that attaches itself to rocks and boats.",
  "Bat": "The only mammal that can truly fly.",
  "Bear": "Large, furry mammals, some eat meat, some eat plants, some eat both.",
  "Bee": "This insect is important for pollinating plants and makes honey.",
  "Black Widow Spider": "A venomous spider known for the red hourglass mark on its belly.",
  "Bonobo": "An intelligent ape, very similar to a chimpanzee.",
  "Buffalo": "A large type of wild cow, found in Africa and Asia.",
  "Bug": "A general word for a small insect.",
  "Bullfrog": "A very large frog known for its deep croaking sound.",
  "Bumblebee": "A large, fuzzy bee that helps pollinate flowers.",
  "Camel": "Known for its humps, which store fat (not water) to help it survive in deserts.",
  "Canary": "A small, yellow songbird often kept as a pet.",
  "Caracal": "A wild cat with long, tufted ears, excellent at jumping.",
  "Caribou": "Another name for reindeer, found in cold northern regions.",
  "Carp": "A common freshwater fish.",
  "Cat": "A popular pet, known for its purring and agility.",
  "Caterpillar": "The wiggly, worm-like stage before a butterfly or moth.",
  "Chicken": "A common farm bird raised for eggs and meat.",
  "Chipmunk": "A small, striped rodent that gathers nuts in its cheek pouches.",
  "Clam": "A shellfish with two hinged shells.",
  "Clownfish": "A colorful fish that lives safely among the stinging tentacles of sea anemones.",
  "Cockatoo": "A type of parrot with a distinctive crest of feathers on its head.",
  "Cow": "A female domesticated bovine, raised for milk and meat.",
  "Crane": "A large bird with long legs and a long neck, known for its graceful dances.",
  "Cricket": "An insect known for the chirping sound males make.",
  "Dolphin": "A very smart marine mammal known for its playful jumps.",
  "Donkey": "A domesticated animal similar to a horse, known for carrying loads.",
  "Duck": "A common water bird, found in ponds, lakes, and oceans.",
  "Egret": "A beautiful white bird often seen standing gracefully in shallow water.",
  "Falcon": "The fastest animal on Earth, it can dive at incredible speeds.",
  "Fish": "These aquatic creatures live in water and breathe using special organs called gills.",
  "Fly": "This insect has special eyes that let it see in many directions at once.",
  "Frog": "This amphibian can breathe through its skin and has powerful jumping legs.",
  "Gazelle": "Known for their amazing speed and springy jumps when running.",
  "Gecko": "These lizards have special pads on their feet that let them walk on walls and ceilings.",
  "Gerbil": "A small, furry rodent often kept as a pet.",
  "Gorilla": "The largest primate, these are strong and intelligent apes.",
  "Grasshopper": "An insect known for its strong jumping legs.",
  "Groundhog": "Known for 'Groundhog Day' when it supposedly predicts spring.",
  "Grouse": "A game bird that lives on the ground and can be hard to spot.",
  "Guinea Pig": "A popular, gentle pet that makes cute squeaking noises.",
  "Hare": "Like a rabbit but with longer ears and legs, these animals are very fast.",
  "Herring": "A small fish that swims in huge schools and is important food for other animals.",
  "Ibis": "A wading bird with a long, curved beak, often found in wetlands.",
  "Iguana": "A large lizard often found in warm, tropical places.",
  "Indri": "The largest type of lemur, it sings loud, haunting songs.",
  "Jacana": "Called the 'Jesus bird' because it looks like it walks on water.",
  "Koel": "A type of cuckoo bird known for laying its eggs in other birds' nests.",
  "Ladyfish": "A sleek, silvery fish found in warm coastal waters.",
  "Lamprey": "An ancient, jawless fish that looks like an eel.",
  "Leaf-tailed Gecko": "A master of disguise, this lizard looks exactly like dead leaves.",
  "Leafcutter Ant": "These insects cut pieces of leaves to grow fungus, which they eat.",
  "Lizard": "A diverse group of reptiles, many can regrow their tails.",
  "Loggerhead Sea Turtle": "A sea turtle with a very large head and powerful jaws.",
  "Long-eared Owl": "An owl with long feather tufts that look like ears.",
  "Mealybug": "A small, soft-bodied insect that can be a pest on plants.",
  "Midshipman Fish": "A fish that can 'sing' loudly and glow in the dark.",
  "Mimic Octopus": "An amazing octopus that can change its shape and color to look like other animals.",
  "Moray Eel": "A long, slithery eel often found hiding in cracks in coral reefs.",
  "Mudskipper": "A unique fish that can walk on land and breathe air.",
  "Muntjac": "A small type of deer from Asia, sometimes called a 'barking deer'.",
  "Naked Mole Rat": "A strange rodent that lives in underground colonies and doesn't get cancer easily.",
  "Newt": "A small amphibian, a type of salamander that lives in water and on land.",
  "Ocean Sunfish": "The largest bony fish in the world, very flat and round.",
  "Oystercatcher": "A wading bird with a long, strong, orange bill for opening shellfish.",
  "Paper Nautilus": "A type of octopus where the female builds a thin, papery shell.",
  "Parrotfish": "A colorful fish that helps create sand by eating coral and pooping it out.",
  "Pipefish": "A slender, elongated fish related to seahorses.",
  "Pygmy Hippopotamus": "A much smaller cousin of the regular hippopotamus.",
  "Rainbow Trout": "A popular freshwater fish known for its colorful stripe.",
  "Rat Snake": "A non-venomous snake that often eats rodents.",
  "Red-eyed Tree Frog": "A bright green frog with striking red eyes.",
  "Ring-tailed Lemur": "A lemur with a long, black and white striped tail.",
  "River Otter": "An otter that lives in rivers and lakes, very playful.",
  "Roan Antelope": "A large African antelope with long, curved horns.",
  "Russian Blue Cat": "A beautiful cat breed with a sleek, silvery-blue coat.",
  "Sable": "A small, valuable fur-bearing mammal from cold regions.",
  "Saiga Antelope": "An antelope with a unique, bulbous nose.",
  "Salmon Shark": "A powerful and fast shark found in cold northern waters.",
  "Scorpionfish": "A venomous marine fish camouflaged to look like rocks.",
  "Secretarybird": "A tall bird of prey that hunts snakes on the ground.",
  "Serval": "A medium-sized wild cat from Africa with very long legs and ears.",
  "Siamese Cat": "A vocal and intelligent cat breed with striking blue eyes and dark points.",
  "Siberian Husky": "A dog breed known for its endurance and ability to pull sleds in the snow.",
  "Sidewinder": "A type of rattlesnake that moves sideways across sand.",
  "Skimmer": "A seabird with a longer lower beak that it uses to 'skim' for fish.",
  "Slender-tailed Meerkat": "The most common species of meerkat, known for its social groups.",
  "Slow Loris": "A small, nocturnal primate with big eyes and a slow, deliberate movement.",
  "Snapping Turtle": "A large freshwater turtle with a strong bite.",
  "Softshell Turtle": "A turtle with a flattened, leathery shell instead of a hard one.",
  "Spiny Anteater": "Another name for an echidna, a mammal that lays eggs.",
  "Springbok": "A fast-running antelope from Southern Africa, known for its jumping displays.",
  "Sugar Glider": "A small, nocturnal marsupial that glides through the air using a membrane.",
  "Swallowtail Butterfly": "A beautiful large butterfly with swallow-like tails on its wings.",
  "Tamarin": "A small New World monkey with long claws instead of nails.",
  "Tarpon": "A large, silvery game fish known for its powerful jumps when hooked.",
  "Tawny Owl": "A common owl in Europe, known for its 'hoo-hoo' call.",
  "Teal": "A small type of dabbling duck.",
  "Tetra": "A small, colorful freshwater fish, popular in aquariums.",
  "Tibetan Mastiff": "A very large, powerful dog breed from Tibet.",
  "Tick": "A tiny arachnid that attaches to animals and feeds on blood.",
  "Titan Triggerfish": "A large and sometimes aggressive reef fish.",
  "Tree Frog": "A frog that spends most of its life in trees.",
  "Tree Kangaroo": "A marsupial that lives in trees, found in New Guinea and Australia.",
  "Trumpeter Swan": "The largest waterfowl in North America, known for its loud call.",
  "Tuatara": "A reptile found only in New Zealand, sometimes called a 'living fossil'.",
  "Turkey Vulture": "A scavenging bird common in the Americas, helps clean up the environment.",
  "Vaquita": "The smallest and most endangered marine mammal, a type of porpoise.",
  "Velvet Worm": "A caterpillar-like creature that sprays sticky slime to catch prey.",
  "Vervet Monkey": "A common type of monkey found in Africa.",
  "Vine Snake": "A slender, camouflaged snake that looks like a vine.",
  "Water Buffalo": "A large type of cow often used for farming in Asia.",
  "Weasel": "A small, quick, and slender carnivorous mammal.",
  "White Rhinoceros": "The largest species of rhinoceros.",
  "White-tailed Deer": "A very common deer in North America, known for its white tail.",
  "Wild Boar": "The wild ancestor of the domestic pig.",
  "Wisent": "The European bison, a large, shaggy bovine.",
  "Wolf Eel": "A long, fierce-looking fish with powerful jaws.",
  "Wood Duck": "A very colorful and beautiful duck species.",
  "Wood Stork": "A large wading bird with a bald head.",
  "Wood Mouse": "A small, common mouse found in woodlands.",
  "Zebra Shark": "A shark that has spots when it's grown up, not stripes.",
  "Zebu": "A type of cattle with a hump on its back, found in hot climates.",
  "Anteater": "This mammal has a super long, sticky tongue to catch thousands of insects.",
  "Anaconda": "One of the largest snakes in the world, it squeezes its prey.",
  "Albatross": "This bird has the longest wingspan of any, helping it fly for miles without flapping."
}
